# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:

import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [17]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [18]:

a

0    100
1    200
2    300
3    400
dtype: int64

In [5]:
a.dtype

dtype('int64')

Using indexing access the element 300 from the series a.

In [6]:
a[2]

300

What are the values of index for series a?

In [14]:

range(0,4,1)

range(0, 4)

Change the index to  ['c', 'a', 'b', 'd']

In [19]:
a.index = ['c', 'a', 'b', 'd']
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [20]:
a["d"]

400

Sort the values wrt to the index and print it

In [21]:

a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [22]:
b = b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [23]:
a = a.append(b)
a

C:\Users\Henry\AppData\Local\Temp\ipykernel_11860\4207074671.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a = a.append(b)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [24]:
#print a again after appending b into it

a

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [25]:
a = a.sort_values(ascending=False)
a

e    800
f    450
d    400
b    300
a    200
c    100
g    100
dtype: int64

Print index of a

In [26]:
a.index

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [27]:
df = pd.DataFrame(a)
df

     0
e  800
f  450
d  400
b  300
a  200
c  100
g  100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [28]:

df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [29]:
# yep its same as the series.

df.index

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tail represent?)

In [30]:

df.head()

     0
e  800
f  450
d  400
b  300
a  200

In [31]:

df.tail()

     0
d  400
b  300
a  200
c  100
g  100

Rename the column of the dataframe as 'points'

In [32]:

df.columns = ["points"]
df

   points
e     800
f     450
d     400
b     300
a     200
c     100
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [34]:
#Create fruits array

import random

fruits_array = np.random.choice(['orange', 'mango', 'apple'], 7)
fruits_array

array(['mango', 'apple', 'mango', 'mango', 'apple', 'mango', 'apple'],
      dtype='<U6')

In [35]:
#Create series fruits out of fruits array

fruits = pd.Series(fruits_array)
fruits

0    mango
1    apple
2    mango
3    mango
4    apple
5    mango
6    apple
dtype: object

Change the index of fruits to the index of dataframe df

In [36]:

fruits.index = ['e', 'f', 'd', 'b', 'a', 'g', 'c']
fruits

e    mango
f    apple
d    mango
b    mango
a    apple
g    mango
c    apple
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [37]:

fruits = pd.DataFrame(fruits)
fruits.columns = ["fruits"]
df1 = pd.concat([fruits, df], axis=1)
df1.head()

  fruits  points
e  mango     800
f  apple     450
d  mango     400
b  mango     300
a  apple     200

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [41]:

d1 = pd.DataFrame()
d1['city'] = ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ]
d1['Temperature'] = [15, 22, 20, 26,-2]

Print(d1)

In [42]:

d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [43]:

d1.shape

(5, 2)

Set city = d1['city']

In [44]:

city = d1['city']

print city <br>
What is the type of city.

In [47]:

city.info

<bound method Series.info of 0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [50]:
d2 = pd.DataFrame()
d2['city'] = ['Bengalaru', 'Coimbatore', 'Srirangam', 'Pondicherry']
d2['Temperature'] = [24, 35, 36, 39]

print the shape of this dataframe

In [51]:

d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [52]:

d3 = pd.concat([d1, d2], axis=0)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [53]:

d3[(d3['Temperature']<= 20)]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [54]:

d3[(d3['Temperature']>= 35)]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [55]:
# write function here

union_terrs = ["Chandigarh", "Pondicherry", "Delhi"]
d3["is_ut"] = d3["city"].isin(union_terrs)

In [56]:
# print d3

d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [57]:
# write function here


def c_to_f(Temperature):
    temp_Fahrenheit = (Temperature*1.8) + 32
    return temp_Fahrenheit

In [58]:
# check function c_to_f(10)

c_to_f(10)

50.0

In [59]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_farenhiet'] = (d3['Temperature']*1.8 + 32)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengalaru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [60]:

d3.iloc[[0, 1, 8], [0, 1, 2, 3]]

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
3  Pondicherry           39   True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [61]:

d3[(d3['temp_farenhiet']>90)]

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d1.

In [62]:
d1.head(3)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20

Select all the rows and last two columns in the dataframe.

In [69]:
d1.loc[:, ["city", "Temperature"]]

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

## Groupby

In [105]:
# Import a dataset of your choice

pd.set_option('display.max_columns', None)
data = pd.read_csv(r"E:\Python for Data Science and Machine Learning\Pivot_data.csv")
data.head()

       Country   Category Department  Price   Revenue
0  Netherlands  Furniture     Dining  499.0  649199.0
1  Netherlands  Furniture     Dining  699.0  638187.0
2  Netherlands  Furniture     Dining  549.0  632997.0
3  Netherlands  Furniture     Dining  599.0  579233.0
4  Netherlands  Furniture     Dining  499.0  474050.0

In [106]:
# Use Groupby of single column with aggregate sum()

data.groupby(["Country"]).Revenue.agg(["sum"])

                     sum
Country
India         4069431.34
Japan         1562238.48
Netherlands  16593328.57

In [108]:
# Use Groupby of single column with aggregate count()

data.groupby(["Country"]).Revenue.agg(["count"])

             count
Country
India          100
Japan          100
Netherlands    100

In [111]:
# Use Groupby of single column with aggregate min() and max()

data.groupby(["Country"]).Revenue.agg(["min","max"])

                  min        max
Country
India        26595.00   64841.00
Japan         1280.00   25991.35
Netherlands  65484.45  649199.00

In [112]:
# Use Groupby of any 2 columns with aggregate mean()

data.groupby(["Country", "Category"]).Revenue.agg(["mean"])

                                mean
Country     Category
India       Furniture   45829.000000
            Home        36411.488077
            Textiles    40760.823585
Japan       Furniture   15987.214286
            Home        15259.449375
            Lighting    14896.080000
            Textiles    15727.381452
Netherlands Furniture  201314.185185
            Home       168940.676667
            Textiles   117717.962750

In [113]:
# Use Groupby of any 2 columns with aggregate min() and max()

data.groupby(["Category", "Department"]).Revenue.agg(["min","max"])

                             min        max
Category  Department
Furniture Bedroom       23067.00  297569.00
          Dining        32982.00  649199.00
          Entryways     52500.00  410400.00
          Kids Room     11368.00  275846.00
          Living Room    1280.00  322848.00
Home      Bath          18692.53   34641.56
          Bedroom      126684.00  126684.00
          Dining         6494.50   10202.65
          Entryways     16112.50   53227.00
          Kitchen       11219.52  319304.00
Lighting  Kids Room     14845.25   15968.00
          Living Room    6987.67   21805.00
Textiles  Bath           8844.93  295350.59
          Bedroom        7192.80  431584.10
          Dining         2818.59   81455.25
          Kids Room      8808.00   91205.85
          Kitchen       13207.95   49017.30

In [114]:
# Use Groupby of any 3 columns with aggregate min() and max()

data.groupby(["Country", "Category", "Department"]).Revenue.agg(["min","max"])

                                         min        max
Country     Category  Department
India       Furniture Bedroom       37905.00   44590.00
                      Dining        32982.00   40228.00
                      Entryways     52500.00   52500.00
                      Kids Room     31200.00   61035.00
                      Living Room   29952.00   60288.00
            Home      Bath          29330.22   34641.56
                      Entryways     31515.00   53227.00
                      Kitchen       26632.80   62038.60
            Textiles  Bath          27505.06   46291.77
                      Bedroom       27243.15   64841.00
                      Dining        26595.00   42393.00
                      Kids Room     29613.15   60875.64
                      Kitchen       27222.23   49017.30
Japan       Furniture Bedroom       23067.00   25948.00
                      Kids Room     11368.00   22001.00
                      Living Room    1280.00   23680.00
            Home      Bath          18692.53   19322.11
                      Dining         6494.50   10202.65
                      Entryways     16112.50   24675.00
                      Kitchen       11219.52   23828.08
            Lighting  Kids Room     14845.25   15968.00
                      Living Room    6987.67   21805.00
            Textiles  Bath           8844.93   23650.40
                      Bedroom        7192.80   25991.35
                      Dining         2818.59   24336.00
                      Kids Room      8808.00   16380.00
                      Kitchen       13207.95   23496.62
Netherlands Furniture Bedroom       68229.00  297569.00
                      Dining        77556.00  649199.00
                      Entryways     68607.00  410400.00
                      Kids Room     88168.00  275846.00
                      Living Room   70884.00  322848.00
            Home      Bedroom      126684.00  126684.00
                      Kitchen       66547.77  319304.00
            Textiles  Bath          76033.27  295350.59
                      Bedroom       65484.45  431584.10
                      Dining        81455.25   81455.25
                      Kids Room     80667.72   91205.85

## Data Range

Create a pandas daterange where starting date is 1st of January,2023 and end date is 1st of April 2024, store it in a new variable named 'a'

In [70]:
date1 = '2023-01-01'
date2 = '2024-01-04'
a = pd.date_range(date1, date2)

print a

In [71]:

a

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2023-12-26', '2023-12-27', '2023-12-28', '2023-12-29',
               '2023-12-30', '2023-12-31', '2024-01-01', '2024-01-02',
               '2024-01-03', '2024-01-04'],
              dtype='datetime64[ns]', length=369, freq='D')

What is the len of a?

In [75]:

len(a)

369

What is the type of a?

In [78]:

type(a)

pandas.core.indexes.datetimes.DatetimeIndex